Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyAttachedTypeWarn Property
 Cannot copy attached detail group type without copying the model group type it refers to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyAttachedTypeWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyAttachedTypeWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyAttachedTypeWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace